Repository: giellalt/corpus-fkv
Catalog: tmx/sme/ficti/lyrics/karasjok_kulturskole_yksi_meista_one_of_us_24.11.2009.doc.tmx
Source language: fkv
Languages: sme

source: Uuet laulut 2010, Karasjok kulturskole
sme: yeah yeah, Son buorre lea

source: Oversatt til kvensk og samisk: Kainun institutti-Kvensk institutt / Pirjo Paavalniemi
sme: Maid juos olmmoš livččii Son

source: Ja yeah yeah, Hän suuri oon,
sme: Ja yeah yeah, Ipmil lea,

source: yeah yeah, Hän siivo oon
sme: yeah yeah, Son buorre lea

source: Yksi houkka niin ko mie
sme: Busses čohkká dego don

source: Tyhä kothiin matkala
sme: Ja son ruoktot jođus lea

source: Hän oon kothiin matkala
sme: Beare ruoktot jođus lea

source: Ei kukhaan hälle ringaakhaan
sme: Baicce juos báhppa riŋgesta
